enum Mountain {
  BUKHAN(
    '북한산',
    37.6986,
    127.0173,
    'assets/images/Bukhan.png',
    """서울특별시와 경기도 고양시, 양주시, 의정부시에 걸쳐있는 산. 삼각산이라고도 한다. 같은 명칭의 국립공원의 범위인 서울특별시 은평구, 서대문구, 종로구, 성북구, 강북구 및 경기도 고양시 덕양구 일원에 걸쳐 있는 봉우리들을 아울러 북한산으로 일컫는다. 세부적으로 우이령을 기준으로 도봉구, 양주시, 의정부시 방면의 북한산 일부를 도봉산으로 따로 말하기도 한다. 서울에서 남산, 한강과 함께 서울을 상징하는 대표적인 상징물이다.  그런데 사실 북한산의 3봉우리 중 백운대(837m), 인수봉(811m)은 모두 행정구역상 서울특별시 영역이 아닌 경기도 고양시 덕양구 북한동 영역으로 되어있다. 즉 엄밀히 말하면 북한산은 서울에 없는 셈이다. 그러나 서울 시내에서도 다 보이는데다가 역사적으로도 북한산은 원래 고양시 땅도 아니었다. 역사 이래 북한산은 양주(楊州)의 땅이었으며, 옛 양주는 조선 왕조 개창과 함께 한성부가 독립된 행정구역으로 분리되기 전까지는 한양 전역도 관할구역으로 두고 있었다. 삼국시대로 더 거슬러 올라가면 현 서울 강북 지역의 옛 이름이 북한산군(北漢山郡) 또는 북한산주(北漢山州)로 즉 아예 그냥 북한산이었다. 북한산이 서울에 없게 된 것은 일제강점기(1914년)의 행정구역 개편 때문이다.지형학적으로 직접 연결된 모체 봉우리는 백두산인데, 대륙 전체로 확대하면 에베레스트라고도 할 수 있다. 사실 에베레스트는 아프로-유라시아 전체의 모체 봉우리이기 때문에 특이한 것은 아니다.""",
  ),
  HALLA('한라산', 33.3617, 126.5336, 'assets/images/Halla.png',
      """한반도에서 두 번째로 높은 산으로 오해하는 경우가 많다.[12] 하지만 한반도 최고봉은 백두산 (2,744m) 이고, 두 번째 산은 함경북도 경성군·연사군의 경계에 위치한 관모봉(2,541m)이며. 세 번째 산은 량강도 김형권군의 북수백산이다. 한반도 북부 지방에는(개마고원 일대) 높은 산 60여 곳이 널렸다.[13] 남한 육지에서는 지리산이 가장 높다. 제주도는 오랫동안 '한라산'이라는 이름으로 대표되는 거대한 순상화산체인 섬이라는 것이 정설이었다. 이것이 제주도 사람들의 한라산에 대한 인식과 합쳐져서 생긴 말이 "한라산이 곧 제주도이며 제주도가 곧 한라산."이다. 그러나 연구 결과가 쌓이면서, 한라산은 제주도를 쌓아올린 여러 단성 내지는 준단성화산체들 중에서 가장 중앙에 크게 쌓인 것에 불과하며, 사실 제주도가 하나의 커다란 화산지대였다는 주장이 힘을 얻고 있다. 실제로 대부분 화산폭발이 한라산의 중심폭발이 아니었다. 한라산은 높은 산이지만, 멀리서 보면 흔히 '산' 하면 떠오르는 뾰족하고 깎아지른 모습이 아니라 비교적 완만한 경사로 되어있다. 순상화산의 특징 중 하나. 한라산은 오랫동안 순상화산으로 분화하다가, 마그마의 분화와 점도 상승으로 인해 종상화산으로 분화 형태가 변화하면서 정상부에 종상화산체를 형성한다.[14] 겨울철에는 대설특보 등으로 입산 통제가 빈번하며 봄철에도 장마급 비가 내리는 한국에서 대표적인 호우 지역이다. 하루에만 1,000mm (1m)[15]이상의 무시무시한 집중호우가 내리는 경우도 있다. 이 점을 잘 공략한다면 물이 가득찬 백록담을 보는 행운을 누릴 수도 있다."""),
  DOBONG('도봉산', 37.6985, 127.0283, 'assets/images/Dobong.png',
      """도봉산(道峰山, 영어: Dobongsan)은 서울특별시 도봉구와 경기도 의정부시 호원동, 양주시 장흥면에 걸쳐 있는 한북정맥의 산이다. 북한산 국립공원의 일부이다. 백두대간의 분수령에서 서남쪽으로 뻗은 한북정맥의 연봉을 따라 운악산·불곡산을 거쳐 남서쪽으로 내려오다가 서울 동북쪽에서 우뚝 솟아 우이령을 경계로 북한산으로 이어진다. 최고봉인 자운봉(紫雲峰, 739.5m), 남쪽으로 만장봉(萬丈峰)·선인봉(仙人峰), 서쪽으로 오봉(五峰)·여성봉이 있다.[1]산의 지리 우람한 기암괴석과 뾰족이 솟은 바위 봉우리들이 장관이며, 사방으로 뻗은 계곡을 따라 녹음이 우거져 있다.[2]만장봉 만장봉의 실제높이는 718m이나 옛날 어르신들이 보기에는 만장이나 되어 보인다하여 '만장봉(萬丈峰)'이라 이름지었다. 야설로는 만장봉 꼭대기에 자일이나 로프도 없이 태조 이성계가 올랐다는 이야기가 있다.여성봉 송추남능선 중간쯤 높이 504m에 자리잡고 있는 여성봉은 그 모양이 여성의 생식기와 유사하여 붙여진 이름이다. 화강암바위의 자연적 풍화작용에 의해 형성된 암봉으로 대자연의 신비로움과 오묘함을 느끼게 한다. 등산길 면적은 24km2로 북한산의 55km2에 비해 등산길이 더 조밀하다. 볼 만한 곳 최고봉인 자운봉(739.5m)을 비롯해서 만장봉·선인봉·주봉·관음봉·오봉·우이암 등 암벽이 아름답다."""),
  SEORAK('설악산', 38.1194, 128.4652, 'assets/images/Seorak.png',
      """백두대간에 위치한 강원특별자치도의 명산. 속초시와 양양군·고성군·인제군에 걸쳐 있다. 높이는 1,708m. 대한민국(남한)에서 한라산, 지리산 다음으로 세 번째로 높은 산이다. 설악산은 추석 무렵부터 이듬해 하지까지 눈이 쌓여 있다고 해서 설악이라 했다고 한다.지리산, 덕유산, 한라산, 북한산과 더불어 한국 5대 명산에 속하며 산림청 과 블랙야크에서 선정한 대한민국 100대 명산에도 이름이 들어가 있다.1970년 3월 24일 지정된 다섯 번째 국립공원이다. 국립공원 총면적은 398.222km²이다.6.25 전쟁이 일어나기 전에는 북한에 속했지만 휴전선이 그어지면서 대한민국이 수복한 지역. 지리산에서 백두산까지 이어지는 한반도의 거대한 산줄기인 백두대간의 척추 부분에 금강산과 약간 떨어진 채 있다. 하필이면 척추 부분에 아름다운 두 산이 있고 두 산의 중간쯤에 휴전선이 지난다. 6.25 전쟁 때 국군이 여기가 금강산인줄 알고 더 진격을 안했다는 농담도 있다. 이러한 이야기들이 얽혀 있는 이유는 실제로 1953년 휴전까지 동부전선에서 가장 격전을 치른 곳 중의 하나이기 때문이다. 매봉·한석산 전투, 펀치볼 전투, 단장의 능선 전투 등이 죄다 설악-금강 축선상에서 이루어진 전투이며 1980년대 반공교육 수기의 단골 주제였는데, 설악산 전투에서 한국군이 북중연합군을 격퇴/패주시켜 금강산 바로 아래까지 막대한 영토와 영해를 획득하는 것에 성공하게 되었다.접근 도로망으로는 서울양양고속도로, 동해고속도로, 44번 국도(한계령), 46번 국도~56번 지방도(미시령), 462번 지방도(설악산로) 등이 있다. 44번 국도는 한계령이 설악산 국립공원 지역을 뚫고 지나가며, 462번 지방도는 속초에서 설악산 국립공원으로 들어갈 때 이용하는 도로이다. 춘천속초선 동서고속화철도를 건설하게 되면 설악산 지하를 뚫고간다. 미시령아래 구간이 설악산 관통 구간이며, 지상으로 나와서 백담사 옆에 백담역이 건설된다.현재 설악산엔 백담사와 신흥사가 위치해 있다.산정과 산 아래의 온도차는 약 12~13℃이다.화강암이 분포한다. 설악산의 지질에 대한 정보는 위키백과에 자세히 나와 있다.속초 7번 시리즈 버스가 설악산을 오간다.""");

  final String title;
  final double lat;
  final double lng;
  final String img;
  final String text;

  const Mountain(this.title, this.lat, this.lng, this.img, this.text);
}
